#  五大数据类型

> 官网文档

![image-20210127002328039](/interview/image-20210127002328039.png)

Redis 是一个开源的、基于内存数据结构的数据库、缓存和消息代理。Redis 提供了 string、hash、list、set和带有范围查询的有序 set~~~

### redis key

## String

```bash
REDIS:0>APPEND key1 "hello" # 追加字符串，如果 key1 不存在，就相当于 SET key1
"7"
REDIS:0>get key1
"v1hello"
REDIS:0>STRLEN key1 # 获取字符串的长度
"7"
REDIS:0>APPEND key1 "zhengjunren"
"18"
REDIS:0>STRLEN key1
"18"
#########################################
REDIS:0>set views 0
"OK"
REDIS:0>incr views ## 自增 1
"1"
REDIS:0>incr views
"2"
REDIS:0>get views
"2"
REDIS:0>decr views ## 自减 1
"1"
REDIS:0>decr views
"0"
REDIS:0>get views
"0"
REDIS:0>INCRBY views 10 # 设置步长的自增
"10"
REDIS:0>INCRBY views 10
"20"
REDIS:0>DECRBY views 10
"10"
########################################
REDIS:0>set key1 "hello,zhengjunren"
"OK"
REDIS:0>GETRANGE key1 0 3 #截取字符串（闭区间）
"hell"
REDIS:0>GETRANGE key1 0 -1 # 获取全部字符串
"hello,zhengjunren"
#######################################
REDIS:0>SET key2 abcdefg
"OK"
REDIS:0>SETRANGE key2 1 xx # 替换指定位置开始的字符串
"7"
REDIS:0>get key2
"axxdefg"
#######################################
# setex (set with expire) 设置过期时间
# setnx (set if not exist) 不存在再设置
#######################################
REDIS:0>setex key3 30 "hello" # 设置 key3 的值为 hello 30秒后过期
"OK"
REDIS:0>ttl key3
"25"
REDIS:0>get key3
"hello"
REDIS:0>setnx mykey "redis" # 如果 mykey 不存在，创建
"1"
REDIS:0>ttl key3
"-2"
REDIS:0>setnx mykey "mongodb" # 如果 mykey 存在，创建失败
"0"
REDIS:0>get mykey
"redis"
#####################################
# mset
# gset
REDIS:0>mset k1 v1 k2 v2 k3 v3 # 同时设置多个值
"OK"
REDIS:0>keys *
 1)  "k3"
 2)  "k2"
 3)  "k1"
REDIS:0>msetnx k1 v1 k4 v4 # msetnx 是原子性操作
"0"
REDIS:0>get k4

# 对象 
set user:1{name:zhangsan,age:3} # 设置 user 对象 json字符串
#####################################
# user:{id}:{field}
REDIS:0>mset user:1:name zhangsan user:1:age 2 
"OK"
REDIS:0>mget user:1:name user:1:age
 1)  "zhangsan"
 2)  "2"
 #####################################
 # getset 先获取在设置
REDIS:0>getset db redis
null
REDIS:0>get db
"redis"
REDIS:0>getset db mongodb
"redis"
REDIS:0>get db
"mongodb"
```

string 类型的场景： value 可以使字符串还可以是数字

+ 计数器
+ 统计数量
+ 粉丝数

## List

可以转化为栈、队列、阻塞队列

所有的 list 的命令都是以字母 l 开头

```bash
REDIS:0>LPUSH list one # 将一个值或者多个值插入至列表的左部
"1"
REDIS:0>LPUSH list two
"2"
REDIS:0>LPUSH list three
"3"
REDIS:0>LRANGE list 0 -1 # 获取所有链表的值
 1)  "three"
 2)  "two"
 3)  "one"
REDIS:0>LRANGE list 0 1 # 通过区间获取具体的值
 1)  "three"
 2)  "two"
REDIS:0>RPUSH list right # 将值插入至链表的右部
"4"
REDIS:0>LRANGE list 0 -1
 1)  "three"
 2)  "two"
 3)  "one"
 4)  "right"
#########################################
REDIS:0>LRANGE list 0 -1
 1)  "three"
 2)  "two"
 3)  "one"
 4)  "right"
REDIS:0>LRANGE list 0 -1
 1)  "three"
 2)  "two"
 3)  "one"
 4)  "right"
REDIS:0>LPOP list # 弹出左边第一个
"three"
REDIS:0>RPOP list # 弹出右边第一个
"right"
REDIS:0>LRANGE list 0 -1
 1)  "two"
 2)  "one"
###########################################
REDIS:0>LINDEX list 1 # 通过下标获取值
"one"
REDIS:0>LINDEX list 0
"two" 
###########################################
REDIS:0>llen list # 返回 list 的长度
"3"
REDIS:0>lrange list 0 -1
 1)  "three"
 2)  "three"
 3)  "two"
 4)  "one"
REDIS:0>lrem list 1 one
"1"
REDIS:0>lrem list 1 three
"1"
REDIS:0>Lpush list three
"3"
REDIS:0>lrem list 2 three
"2"
REDIS:0>lrange list 0 -1
 1)  "two"
###########################################
REDIS:0>RPUSH MYLIST HELLO
"1"
REDIS:0>RPUSH MYLIST HELLO1
"2"
REDIS:0>RPUSH MYLIST HELLO2
"3"
REDIS:0>RPUSH MYLIST HELLO3
"4"
REDIS:0>LTRIM MYLIST 1 2 # 通过下标截取指定的长度
"OK"
REDIS:0>LRANGE MYLIST 0 -1
 1)  "HELLO1"
 2)  "HELLO2"
########################################### 
REDIS:0>LRANGE MYLIST 0 -1
 1)  "HELLO1"
 2)  "HELLO2"
 3)  "HELLO"
REDIS:0>RPOPLPUSH MYLIST MYOTHERLIST # 移除列表最后一个元素，将其移动至另一列表中
"HELLO"
REDIS:0>LRANGE MYLIST 0 -1
 1)  "HELLO1"
 2)  "HELLO2"
REDIS:0>LRANGE MYOTHERLIST 0 -1
 1)  "HELLO"
 ########################################### 
REDIS:0>EXISTS LIST # 判断列表是否存在
"0"
REDIS:0>LSET LIST 0 ITEM # 如果不存在，报错
"ERR no such key"
REDIS:0>LPUSH LIST VALUE1
"1"
REDIS:0>LRANGE LIST 0 0
 1)  "VALUE1"
REDIS:0>LSET LIST 0 ITEM # 将列表指定下标的值替换为另一个值（更新操作）
"OK"
REDIS:0>LRANGE LIST 0 0
 1)  "ITEM"
```

使用场景：消息排队，消息队列

## set

set 中的值不能重复

```bash
REDIS:0>sadd myset hello # set 集合中添加数据
"1"
REDIS:0>sadd myset zheng 
"1"
REDIS:0>smembers myset # 查看指定 set 中的所有值
 1)  "hello"
 2)  "zheng"
REDIS:0>sismember myset hello # 判断某个值是否在 set 中
"1"
REDIS:0>sismember myset world
"0"
###########################################
REDIS:0>scard myset # 获取 set 集合中的元素个数
"2"
REDIS:0>srem myset hello # 移除 set 中的元素
"1"
REDIS:0>scard myset
"1"
REDIS:0>smembers myset
 1)  "zheng"
###########################################
REDIS:0>smembers myset
 1)  "ren"
 2)  "jun"
 3)  "zheng"
REDIS:0>SRANDMEMBER myset # 随机取出一个元素
"zheng"
REDIS:0>SRANDMEMBER myset 2 # 随机取出两个元素
 1)  "ren"
 2)  "zheng"
###########################################
REDIS:0>SADD KEY1 A
"1"
REDIS:0>SADD KEY1 B
"1"
REDIS:0>SADD KEY1 C
"1"
REDIS:0>SADD KEY2 A
"1"
REDIS:0>SADD KEY2 D
"1"
REDIS:0>SADD KEY2 E
"1"
REDIS:0>SDIFF KEY1 KEY2
 1)  "C"
 2)  "B"
REDIS:0>SINTER KEY1 KEY2 # 找两个 set 中的交集
 1)  "A"
```

微博 A  用户将所关注的人放在一个 set 集合中，将它的粉丝也放在一个集合中，共同爱好

## Hash

key - map

适合存储用户的信息

